START_TEXT = "Привет! Меня зовут Валли … 🤖.  Добро пожаловать на такое-то событие … . Тебя ждут х зон, более у эко-миссий. Давай вместе [про геймификацию] . Ты готов(а) … ?"
AFTER_START_TEXT = "Рад знакомству {name}! Самое время … ."

MAIN_MENU_TEXT = "[Info text]"

# Menu
GO_TO_MAIN_MENU = "Перейти в меню"
GO_TO_MAIN_MENU_SHORT = "В меню ⤵️"
GO_BACK_TO_MAIN_MENU = "Вернуться в меню"

# Locations
LOCATIONS_MAP_TEXT = "[Locations map text]"

# HELPERS
GO_BACK = "Назад ⤵️"
NEXT_PAGE = "Вправо ➡️"
PREV_PAGE = "⬅️ Влево"
